{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "8f87244c",
   "metadata": {},
   "source": [
    "### Map CAD instantiedata rioleringen Utrecht naar NLCS Classificatie concepten obv NLCS Tekenstandaard laagnamen"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "c9145c26",
   "metadata": {},
   "outputs": [],
   "source": [
    "import json\n",
    "from rdflib import Graph\n",
    "\n",
    "with open(\"resources/points-utrecht.geojson\", 'r') as f:\n",
    "    data = json.load(f)\n",
    "\n",
    "kopieOriginalFile = {\n",
    "    \"type\": \"FeatureCollection\",\n",
    "    \"name\": \"points-utrecht-alignment-nlcs\",\n",
    "    \"crs\": {\n",
    "        \"type\": \"name\",\n",
    "        \"properties\": {\n",
    "            \"name\": \"urn:ogc:def:crs:EPSG::7415\"\n",
    "        }\n",
    "    },\n",
    "    \"features\": []\n",
    "}\n",
    "\n",
    "g = Graph().parse(\"resources/NLCS_Classificatie_Kern_v0_0_4.ttl\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "f96bba14",
   "metadata": {},
   "outputs": [],
   "source": [
    "def retrieve_related_nlcs_class(g, name):\n",
    "  nlcsLayerQuery = f\"\"\"\n",
    "  PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "  PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "  PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "  PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "  PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "  PREFIX dcterms: <http://purl.org/dc/terms/>\n",
    "  PREFIX sh: <http://www.w3.org/ns/shacl#>\n",
    "\n",
    "  SELECT ?uri\n",
    "  WHERE {{\n",
    "    ?uriRi a owl:Class .\n",
    "    ?uriRi skos:prefLabel \"RI\" .\n",
    "    ?uri rdfs:subClassOf+ ?uriRi .\n",
    "    ?uri skos:prefLabel \"{name}\" .\n",
    "  }} LIMIT 1\n",
    "  \"\"\"\n",
    "\n",
    "  results = g.query(nlcsLayerQuery)\n",
    "  for res in results:\n",
    "    return res.uri"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "999164fb",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "R-WE-RI-HWA_TRANSPORTLEIDING_PVC_125-INLAATKOLK-S\n",
      "B-WE-RI-VWA_RIOOLPUT-S\n",
      "R-WE-RI-HWA_RIOOLPUT-S\n",
      "R-WE-RI-VWA_TRANSPORTLEIDING_PVC_160_VERLOOP_125_FASE_BLIND-S\n",
      "R-WE-RI-VWA_HULPSTUK_EINDKAP_160-S\n",
      "R-WE-RI-HWA_TRANSPORTLEIDING_PVC_125-INLAAT-AFGEDOPT-S\n",
      "R-WE-RI-VWA_HULPSTUK_ERFSCHEIDINGSPUT-125_FASE_RESTANT-S\n",
      "R-WE-RI-VWA_RIOOLPUT-S\n",
      "R-WE-RI-VWA_VETAFSCHEIDER-RIOOLPUT-S\n",
      "R-WE-RI-HWA_UITSTROOMBAK-S\n",
      "R-WE-RI-HWA_TRANSPORTLEIDING_VERVAL-S\n",
      "R-WE-RI-HWA_TRANSPORTLEIDING_PVC_125-INLAAT-S\n",
      "R-WE-RI-VWA_TRANSPORTLEIDING_PVC_125-INLAAT-S\n",
      "R-WE-RI-HWA_HULPSTUK_ERFSCHEIDINGSPUT-125_FASE_RESTANT-S\n"
     ]
    }
   ],
   "source": [
    "features = data['features']\n",
    "\n",
    "nlcs = []\n",
    "nlcsClean = []\n",
    "featuresNlcs = []\n",
    "for feature in features:\n",
    "    properties = feature['properties']\n",
    "    if properties['autocad_Z_layer']:\n",
    "        if '-RI-' in properties['autocad_Z_layer']:\n",
    "            # print(properties['autocad_Z_layer'])\n",
    "            name = properties['autocad_Z_layer'].split(\"-RI-\")[1].split(\"-\")[0]\n",
    "            # name = name.replace(\"VWA_\", \"DWA_\")  # is VWA gelijk aan DWA? DWA heeft external link naar gwsw:VuilWaterStelsel > Elisabeth denkt van wel\n",
    "            uri = retrieve_related_nlcs_class(g, name)\n",
    "            feature[\"nlcs_classificatie_object\"] = uri\n",
    "            featuresNlcs.append(feature)\n",
    "            nlcs.append(properties['autocad_Z_layer'])\n",
    "            nlcsClean.append(name)\n",
    "\n",
    "nlcs = list(set(nlcs))\n",
    "for layer in nlcs:\n",
    "    print(layer)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "cab49c07",
   "metadata": {},
   "outputs": [],
   "source": [
    "kopieOriginalFile[\"features\"] = featuresNlcs\n",
    "\n",
    "json_str = json.dumps(kopieOriginalFile)  #, indent=4)\n",
    "with open(\"resources/points-utrecht-nlcs.geojson\", \"w\") as f:\n",
    "    f.write(json_str)\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "venv2 (3.9.10)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.10"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
